// Gems with value 10 golden coins
export const gem10gcData: Array<string> = [
  "Азурит (непрозрачный, пёстрый тёмно-синий)",
  "Бирюза (непрозрачная, зелёно-голубая)",
  "Гематит (непрозрачный, серо-чёрный)",
  "Глазчатый агат (полупрозрачный, чередующиеся круги серого, белого, коричневого, голубого или зелёного цвета)",
  "Голубой кварц (прозрачный, голубой)",
  "Лазурит (непрозрачный, голубой и синий с жёлтыми вкраплениями)",
  "Малахит (непрозрачный, с чередующимися светло- и тёмно-зелёными полосами)",
  "Моховой агат (полупрозрачный, розовый или бело-жёлтый с мшистыми серыми или зелёными пятнами)",
  "Обсидиан (непрозрачный, чёрный)",
  "Полосчатый агат (полупрозрачный, с чередующимися коричневыми, голубыми, белыми или красными полосами)",
  "Родохрозит (непрозрачный, светло-розовый)",
  "Тигровый глаз (полупрозрачный, коричневый с золотой серединкой)",
];

// Gems with value 50 golden coins
export const gem50gcData: Array<string> = [
  "Гелиотроп (непрозрачный, тёмно-серый с красными вкраплениями)",
  "Звёздчатый розовый кварц (полупрозрачный, розовый камень с белой звездой по центру)",
  "Кварц (прозрачный, белый, дымчатый или жёлтый)",
  "Лунный камень (полупрозрачный, белый с бледно-голубым отливом)",
  "Оникс (непрозрачный, чёрно-белые полосы или чисто чёрный или белый)",
  "Сардоникс (непрозрачный, бело-красные полосы)",
  "Сердолик (непрозрачный, оранжевый с переходом в красно-коричневый)",
  "Халцедон (непрозрачный, белый)",
  "Хризопраз (полупрозрачный, зелёный)",
  "Циркон (прозрачный, бледный зелёно-голубой)",
  "Цитрин (прозрачный, жёлто-коричневый)",
  "Яшма (непрозрачная, синяя, чёрная или коричневая)",
];

// Gems with value 100 golden coins
export const gem100gcData: Array<string> = [
  "Аметист (прозрачный, тёмно-фиолетовый)",
  "Гагат (непрозрачный, чёрный)",
  "Гранат (прозрачный, красный, зелёно-коричневый или фиолетовый)",
  "Жемчуг (непрозрачный, переливчатый белый, жёлтый или розовый)",
  "Коралл (непрозрачный, тёмно-красный)",
  "Нефрит (полупрозрачный, светло- или тёмно-зелёный, белый)",
  "Турмалин (прозрачный, бледно-зелёный, синий, коричневый или красный)",
  "Хризоберилл (прозрачный, жёлто-зелёный или светло-зелёный)",
  "Шпинель (прозрачная, красная, красно-коричневая или тёмно-зелёная)",
  "Янтарь (прозрачный, жёлто-золотой)",
];

// Gems with value 500 golden coins
export const gem500gcData: Array<string> = [
  "Аквамарин (прозрачный, зелёно-голубой)",
  "Александрит (прозрачный, тёмно-зелёный)",
  "Синяя шпинель (прозрачная, синяя)",
  "Топаз (прозрачный, золотисто-жёлтый)",
  "Хризолит (прозрачный, сочный оливково-зелёный)",
  "Чёрный жемчуг (непрозрачный, чисто чёрный)",
];

// Gems with value 1000 golden coins
export const gem1000gcData: Array<string> = [
  "Голубой сапфир (прозрачный, от бело-голубого до умеренно синего)",
  "Жёлтый сапфир (прозрачный, огненно-жёлтый или жёлто-зелёный)",
  "Звёздчатый рубин (полупрозрачный, рубин с белёсой звездой в центре)",
  "Звёздчатый сапфир (полупрозрачный, синий сапфир с белёсой звездой в центре)",
  "Изумруд (прозрачный, насыщенный ярко-зелёный)",
  "Огненный опал (полупрозрачный, огненно-красный)",
  "Опал (полупрозрачный, голубой с зелёными и золотыми вкраплениями)",
  "Чёрный опал (полупрозрачный, тёмно-зелёный с чёрными пятнышками и золотыми вкраплениями)",
];

// Gems with value 5000 golden coins
export const gem5000gcData: Array<string> = [
    "Алмаз (прозрачный, сине-белый, ярко-жёлтый, розовый, коричневый или синий)",
    "Гиацинт (прозрачный, огненно-оранжевый)",
    "Рубин (прозрачный, чисто красный с переходом в тёмно-алый)",
    "Чёрный сапфир (полупрозрачный, блестящий чёрный с яркими вкраплениями)",
  ];