// Treasure with value 25 golden coins
export const treasure25gcData: Array<string> = [
    "Серебряный кувшин",
    "Резная статуэтка из кости",
    "Маленький золотой браслет",
    "Одеяние из золотой парчи",
    "Чёрная бархатная маска, вышитая серебряной нитью",
    "Медная чаша с серебряной филигранью",
    "Пара гравированных игральных костей",
    "Небольшое зеркальце в расписной деревянной раме",
    "Вышитый шёлковый носовой платок",
    "Золотой медальон с портретом возлюбленной внутри",
  ];
  
  // Treasure with value 250 golden coins
  export const treasure250gcData: Array<string> = [
    "Золотое кольцо с гелиотропами",
    "Резная статуэтка слоновой кости",
    "Большой золотой браслет",
    "Серебряной ожерелье с кулоном из поделочного камня",
    "Бронзовая корона",
    "Шёлковая мантия с золотой вышивкой",
    "Большой мастерски вытканный гобелен",
    "Латунная кружка, инкрустированная нефритом",
    "Коробочка с бирюзовыми фигурками животных",
    "Золотая клетка для птиц, инкрустированная электрумом",
  ];
  
  // Treasure with value 750 golden coins
  export const treasure750gcData: Array<string> = [
    "Серебряная чаша, декорированная лунным камнем",
    "Длинный меч из посеребрённой стали",
    "Резная арфа из экзотической древесины, с инкрустацией из слоновой кости и драгоценными цирконами",
    "Небольшой золотой идол",
    "Гребень в виде золотого дракона со вставленными в глаза гранатами",
    "Бутыль, запечатанная пробкой с тиснением по золотой фольге и украшенная аметистами",
    "Церемониальный кинжал из электрума с чёрной жемчужиной в навершии",
    "Серебряно-золотая брошь",
    "Обсидиановая статуэтка с золотой инкрустацией",
    "Расписная боевая маска из золота",
  ];
  
  // Treasure with value 2500 golden coins
  export const treasure2500gcData: Array<string> = [
    "Прекрасная золотая цепь с огненным опалом",
    "Старинный шедевр живописи",
    "Расшитая шёлком и бархатом мантия, украшенная лунными камнями",
    "Платиновый браслет с сапфиром",
    "Вышитые перчатки, усыпанные драгоценными камнями",
    "Украшенный драгоценными камнями ножной браслет",
    "Золотая музыкальная шкатулка",
    "Золотой браслет, украшенный аквамаринами",
    "Глазная повязка с ложным глазом из голубого сапфира и лунного камня",
    "Ожерелье из маленьких розовых жемчужин",
  ];
  
  // Treasure with value 7500 golden coins
  export const treasure7500gcData: Array<string> = [
    "Украшенная драгоценностями золотая корона",
    "Украшенное драгоценностями платиновое кольцо",
    "Небольшая золотая статуэтка с рубинами",
    "Золотой кубок с изумрудами",
    "Золотая шкатулка для драгоценностей с платиновой филигранью",
    "Расписанный золотом детский саркофаг",
    "Нефритовая игральная доска с золотыми фигурками",
    "Украшенный драгоценными камнями рог для напитков слоновой кости, инкрустированный золотой филигранью",
  ];
  